КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Сотрудники/КонтурЛогистика_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Сотрудники</name>
  <attributes>
    <name>ВУДатаВыдачи</name>
    <comment>(Для водителя) Обязателен при отсутствии ИНН физ. лица</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУНомер</name>
    <comment>(Для водителя) Обязателен при отсутствии ИНН физ. лица</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУСерия</name>
    <comment>(Для водителя) Обязателен при отсутствии ИНН физ. лица</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <comment>(Для кладовщика) если кладовщик указывается, то обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <comment>обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>ИНН физического лица, Обязателен при отсутствии &lt;НомВУ> и &lt;СерВУ> и &lt;ДатаВыдВУ></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИныеСведения</name>
    <comment>(Для кладовщика) Иные сведения, идентифицирующие физическое лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПолномочий</name>
    <comment>(Для кладовщика) Основание полномочий ТЕКСТ (доверия) на осуществление действий по погрузке груза в транспортное средство: по умолч: &quot;должностные обязанности&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПолномочийДоговор</name>
    <comment>(Для кладовщика)  Основание полномочий ДОГОВОР (доверия) на осуществление действий по погрузке груза в транспортное средство</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <comment>необязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольВодитель</name>
    <comment>Признак, что Может выступать в качестве водителя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РольКладовщик</name>
    <comment>Признак, что Может выступать в качестве кладовщика</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РольМедик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МедЛицензия</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
    </type>
  </attributes>
  <attributes>
    <name>РольМеханик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонЗапасной</name>
    <comment>необязателен</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонОсновной</name>
    <comment>обязателен, в любом формате</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <comment>обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаЖительства</name>
    <comment>АдрИнфТип</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаЖительстваСтрана</name>
    <comment>АдрИнфТип</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонЗарегестрированВТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДОПОГСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОПОГНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОПОГДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИныеКонтактныеДанные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрешенияРаботыСДокументами</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>МожетПодписывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МожетПередаватьНаПодпись</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Сотрудники/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СотрудникСсылка = Данные.Ссылка;
	Если Не ЗначениеЗаполнено(СотрудникСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если СотрудникСсылка.РольВодитель Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеСотрудника = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
			СотрудникСсылка, "Фамилия, Имя, Отчество, ВУСерия, ВУНомер");
		
		Представление = СокрЛП(ДанныеСотрудника.Фамилия);
		
		Если ЗначениеЗаполнено(ДанныеСотрудника.Имя) Тогда
			Представление = Представление + " " + Лев(СокрЛП(ДанныеСотрудника.Имя), 1) + ".";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеСотрудника.Отчество) Тогда
			Представление = Представление + " " + Лев(СокрЛП(ДанныеСотрудника.Отчество), 1) + ".";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеСотрудника.ВУНомер) Тогда
			Представление = Представление + " (";
			Если ЗначениеЗаполнено(ДанныеСотрудника.ВУСерия) Тогда
				Представление = Представление + СокрЛП(ДанныеСотрудника.ВУСерия) + " ";
			КонецЕсли;
			Представление = Представление + СокрЛП(ДанныеСотрудника.ВУНомер) + ")";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ОтборРоль") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборРоль = Параметры.ОтборРоль;
	
	Если ОтборРоль = "Водители" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СоставСтрокиПоиска = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(Параметры.СтрокаПоиска, " ");
		
		Если СоставСтрокиПоиска.Количество() < 2 Тогда
			СтрокаПоискаСерии = Параметры.СтрокаПоиска;
			СтрокаПоискаНомера = Параметры.СтрокаПоиска;
		Иначе
			ТекущийНомер = СоставСтрокиПоиска[СоставСтрокиПоиска.Количество() - 1];
			Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СтрокаСодержитТолькоЦифры(ТекущийНомер) Тогда
				СтрокаПоискаСерии = СокрЛП(СтрЗаменить(Параметры.СтрокаПоиска, ТекущийНомер, ""));
				СтрокаПоискаНомера = ТекущийНомер;
			КонецЕсли;
		КонецЕсли;
		
		// Отбор по наименованию и ВУ
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СтрокаПоискаНаименование", "%" + Параметры.СтрокаПоиска + "%");
		Запрос.УстановитьПараметр("СтрокаПоискаСерии", "%" + СтрокаПоискаСерии + "%");
		Запрос.УстановитьПараметр("СтрокаПоискаНомера", "%" + СтрокаПоискаНомера + "%");
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
		|	КонтурЛогистика_Сотрудники.Ссылка КАК Ссылка,
		|	КонтурЛогистика_Сотрудники.Наименование КАК Наименование
		|ИЗ
		|	Справочник.КонтурЛогистика_Сотрудники КАК КонтурЛогистика_Сотрудники
		|ГДЕ
		|	(КонтурЛогистика_Сотрудники.Наименование ПОДОБНО &СтрокаПоискаНаименование
		|			ИЛИ ВЫБОР
		|				КОГДА &СтрокаПоискаСерии = &СтрокаПоискаНомера
		|					ТОГДА КонтурЛогистика_Сотрудники.ВУСерия ПОДОБНО &СтрокаПоискаСерии
		|							ИЛИ КонтурЛогистика_Сотрудники.ВУНомер ПОДОБНО &СтрокаПоискаНомера
		|				ИНАЧЕ КонтурЛогистика_Сотрудники.ВУСерия ПОДОБНО &СтрокаПоискаСерии
		|						И КонтурЛогистика_Сотрудники.ВУНомер ПОДОБНО &СтрокаПоискаНомера
		|			КОНЕЦ)
		|	И КонтурЛогистика_Сотрудники.РольВодитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		СписокСотрудников = Новый СписокЗначений;
		СписокСотрудников.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
		ДанныеВыбора = СписокСотрудников;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПереходНаЭПЛ502

Процедура ЗаполнитьСНИЛСВФормате502(ТихийРежим = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_Сотрудники.Ссылка КАК Ссылка,
		|	КонтурЛогистика_Сотрудники.СНИЛС КАК СНИЛС
		|ИЗ
		|	Справочник.КонтурЛогистика_Сотрудники КАК КонтурЛогистика_Сотрудники
		|ГДЕ
		|	КонтурЛогистика_Сотрудники.СНИЛС <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВФорматеСНИЛС(ВыборкаДетальныеЗаписи.СНИЛС) Тогда
			СотрудникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СотрудникОбъект.СНИЛС = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПривестиЗначениеКФорматуСНИЛС(ВыборкаДетальныеЗаписи.СНИЛС);
			// используем ОбменДанными.Загрузка = Истина;, т. к. в модуле объекта в ПередЗаписью так же проверяем СНИЛС 
			СотрудникОбъект.ОбменДанными.Загрузка = Истина;
			СотрудникОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ТихийРежим Тогда
		Сообщить("Заполнение СНИЛС выполнено");
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьОписаниеКлючейПоиска() Экспорт
	
	// Поиск сотрудника осуществляется по:
	// 1. СНИЛС
	// 2. ИНН
	// 3. ВУ (номер + серия)
	// 4. ФИО + Дата рождения
	// 5. ФИ + Дата рождения
	// 6. Если включена настройка ""Автоконвертация сотрудников по ФИО без идентификатора"", то Фамилия + Имя + Отчество
	
	ШаблонСтрокиПоиска = " И КонтурЛогистика_Справочник.%1 = &%1";
	
	КлючиПоиска = Новый Массив;
	
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска, "СНИЛС", ШаблонСтрокиПоиска);
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска, "ИНН", ШаблонСтрокиПоиска);
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска, "ВУНомер,ВУСерия", ШаблонСтрокиПоиска);	
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска, "Фамилия,Имя,Отчество,ДатаРождения", ШаблонСтрокиПоиска);
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска, "Фамилия,Имя,ДатаРождения", ШаблонСтрокиПоиска);
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("АвтоконвертацияСотрудниковПоФИОБезДР") Тогда 
		КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска, "Фамилия,Имя,Отчество", ШаблонСтрокиПоиска);
	КонецЕсли;
	
	Возврат КлючиПоиска;
	
КонецФункции

Функция ТекстОшибкиНеЗаполненыКлючевыеРеквизиты() Экспорт
	
	ТекстОшибки = "Ошибка при поиске Сотрудника. Не заполнен один из ключевых реквизитов в одном из вариантов поиска:
		|1. СНИЛС
		|2. ИНН
		|3. Данные водительского удостоверения (Номер, серия, дата выдачи)
		|4. Фамилия + Имя + Отчество + Дата рождения
		|5. Фамилия + Имя + Дата рождения
		|6. Если включена настройка ""Автоконвертация сотрудников по ФИО без идентификатора"", то Фамилия + Имя + Отчество";
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция ТекстОшибкиПроверкиИНН(ИНН) Экспорт 
	
	ТекстОшибки = "";
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		
		Если Не СтрДлина(ИНН) = 12
			Или Не КонтурЛогистика_ОбщегоНазначенияСервер.СтрокаСодержитТолькоЦифры(ИНН) Тогда
			
			ТекстОшибки = "Неверный ИНН (должно быть 12 цифр)";
			
		ИначеЕсли Не КонтурЛогистика_ОбщегоНазначенияСервер.КонтрольнаяСуммаИННФЛСовпадает(ИНН) Тогда
			
			ТекстОшибки = "Неверный ИНН (не совпадает контрольная сумма)";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

Процедура ДобавитьРазрешенияПоОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_СотрудникиРазрешенияРаботыСДокументами.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СотрудникиСРазрешениями
	|ИЗ
	|	Справочник.КонтурЛогистика_Сотрудники.РазрешенияРаботыСДокументами КАК КонтурЛогистика_СотрудникиРазрешенияРаботыСДокументами
	|ГДЕ
	|	КонтурЛогистика_СотрудникиРазрешенияРаботыСДокументами.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_Сотрудники.Ссылка КАК Ссылка,
	|	СотрудникиСРазрешениями.Ссылка КАК СсылкаСРазрешениями
	|ПОМЕСТИТЬ Сотрудники
	|ИЗ
	|	Справочник.КонтурЛогистика_Сотрудники КАК КонтурЛогистика_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ СотрудникиСРазрешениями КАК СотрудникиСРазрешениями
	|		ПО СотрудникиСРазрешениями.Ссылка = КонтурЛогистика_Сотрудники.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.СсылкаСРазрешениями ЕСТЬ NULL";
	
	ВыборкаСотрудники = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСотрудники.Следующий() Цикл
		
		СотрудникОбъект = ВыборкаСотрудники.Ссылка.ПолучитьОбъект();
		СотрудникОбъект.ОбменДанными.Загрузка = Истина;
		
		// Добавим разрешения в разрезе организации
		НоваяСтрока = СотрудникОбъект.РазрешенияРаботыСДокументами.Добавить();
		НоваяСтрока.Организация = Организация;
		НоваяСтрока.МожетПодписывать = Истина;
		НоваяСтрока.МожетПередаватьНаПодпись = Ложь;
		
		Попытка
			СотрудникОбъект.Записать();
		Исключение
			Сообщить("Не удалось добавить разрешения по организации в сотрудника: " + Строка(ВыборкаСотрудники.Ссылка));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьСотрудникаПередВыгрузкойВСервис(Сотрудник) Экспорт
		
	массивОшибок = Новый Массив;
	
	Если Не ЗначениеЗаполнено(Сотрудник.Фамилия) Тогда
		массивОшибок.Добавить("Не заполнена фамилия");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Сотрудник.Имя) Тогда
		массивОшибок.Добавить("Не заполнено имя");
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Сотрудник.ВУСерия) И Не ЗначениеЗаполнено(Сотрудник.ВУНомер) И Не ЗначениеЗаполнено(Сотрудник.ВУДатаВыдачи) Тогда
		массивОшибок.Добавить("Не заполнены данные ВУ");
	ИначеЕсли ЗначениеЗаполнено(Сотрудник.ВУСерия) Или ЗначениеЗаполнено(Сотрудник.ВУНомер) Или ЗначениеЗаполнено(Сотрудник.ВУДатаВыдачи) Тогда
		
		Если Не ЗначениеЗаполнено(Сотрудник.ВУСерия) Тогда
			массивОшибок.Добавить("Не заполнена серия ВУ");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Сотрудник.ВУНомер) Тогда
			массивОшибок.Добавить("Не заполнена номер ВУ");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Сотрудник.ВУДатаВыдачи) Тогда
			массивОшибок.Добавить("Не заполнена дата выдачи ВУ");
		КонецЕсли;
		
	КонецЕсли;
	
	

	Возврат массивОшибок;
	
Конецфункции

Функция ОбязательныеРеквизиты() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ВУНомер");
	МассивОбязательных.Добавить("ВУДатаВыдачи");
	МассивОбязательных.Добавить("ДатаРождения");
	МассивОбязательных.Добавить("Имя");
	МассивОбязательных.Добавить("ИНН");
	МассивОбязательных.Добавить("Отчество");
	МассивОбязательных.Добавить("ВУСерия");
	МассивОбязательных.Добавить("Фамилия");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция УсловноОбязательныеРеквизиты() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("РольВодитель");
	МассивОбязательных.Добавить("Должность");
	МассивОбязательных.Добавить("ТелефонОсновной");
	
	Возврат МассивОбязательных;
	
КонецФункции

#КонецОбласти

#КонецЕсли
